<a href="https://colab.research.google.com/github/ssosoo/git_study/blob/main/SQL/SQL1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**SQL Light 를 사용하기 때문에 cursor.execute() 함수 안에 실행한다.**

In [1]:
import sqlite3

# 가상 데이터베이스 생성
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# 테이블 생성
cursor.execute("CREATE TABLE users (id INTEGER PRIMARY KEY, name TEXT, age INTEGER);")

# 데이터 삽입
cursor.execute("INSERT INTO users (name, age) VALUES ('홍길동', 25);")
cursor.execute("INSERT INTO users (name, age) VALUES ('이몽룡', 30);")

# 데이터 조회
cursor.execute("SELECT * FROM users;")
print(cursor.fetchall())  # 결과 출력

# 연결 종료
conn.close()

[(1, '홍길동', 25), (2, '이몽룡', 30)]

**SELECT DISTINCT**

조회 시 중복 값을 제외하고 교윳값만을 출력한다.

In [ ]:
#EMP 테이블에서 모든 칼럼을 조회
SELECT
  *
FROM
  EMP;

#EMP 테이블에서 특정 칼럼을 조회
SELECT
       EMPNO
     , ENAME
     , JOB
FROM
      EMP;


#EMP 테이블에서 중복값을 제외한 칼럼을 조회
SELECT DISTINCT
      JOB
FROM
      EMP;

**AS**

(ALIAS)를 사용해 칼럼 or 테이블에 임시 이름을 지정한다.


별칭에 공백이 포함될 경우 큰따옴표 사용. "사원 번호"

In [ ]:
from os import EX_TEMPFAIL
SELECT
      EMPNO AS 사원번호
    , ENAME AS 사원이름
FROM
      EMP
#데이터 정렬
ORDER BY
      EMPNO;

**산술 연산자와 문자 합성 연산자**

In [ ]:
SELECT
      ENAME
    , SAL
    , COMM
    , (SAL + NVL(COMM, 0)) AS TOTAL_COMP
FROM
      EMP;

In [ ]:
SELECT
      ENAME
    , SAL
    , COMM
    , (SAL - NVL(COMM, 0)) AS NET_SAL
FROM
      EMP;

In [ ]:
SELECT
      ENAME
    , SAL
    , (SAL * 12) AS ANNUAL_SAL
FROM
      EMP;

In [ ]:
SELECT
      ENAME
    , SAL
    , (SAL / 12) AS WEEKLY_SAL
FROM
      EMP;

In [ ]:
# 나머지 연산자(MySQL, PostgreSQL 등)
# CASE WHEN 구문 사용
SELECT
      ENAME
    , EMPNO
    , CASE
          WHEN EMPNO % 2 = 0 THEN '짝수'
          ELSE '홀수'
      END AS ID_TYPE
FROM
      EMP;

In [ ]:
# 문자 합성 연산자
# SQL Server의 경우 문자와 문자를 연결할 때 '+' 사용
SLECT
      ENAME || ' is a ' || JOB EMPLOYEE_INFO
FROM
    EMP;

**NULL**


더하기 연산에서 NULL이 나올 경우 결과또한 NULL이 된다.

ex) 4000+NULL = NULL